tutorials/fluidSolidInteraction/3dTube/linearElastic3dTube/constant/solid/solidProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      solidProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//solidModel linearGeometryTotalDisplacement;
solidModel unsLinearGeometry;
//solidModel unsTotalLagrangianSolid;
//solidModel nonLinearGeometryTotalLagrangian;

"linearGeometryTotalDisplacementCoeffs|unsLinearGeometryCoeffs"
{
    nCorrectors             200;
    convergenceTolerance    1e-7;
    relConvergenceTolerance 1e-3;
}

nonLinearGeometryTotalLagrangianCoeffs
{
    nCorrectors             200;
    convergenceTolerance    1e-7;
    relConvergenceTolerance 1e-3;
}

unsTotalLagrangianSolidCoeffs
{
    nCorrectors             200;
    convergenceTolerance    1e-7;
    relConvergenceTolerance 1e-3;
    nonLinear no;
    debug no;
}

unsIncrTotalLagrangianSolidCoeffs
{
    nCorrectors             200;
    convergenceTolerance    1e-7;
    relConvergenceTolerance 1e-3;
    nonLinear no;
    debug no;
}

// ************************************************************************* //
